Repository: schlueter/GuidoVanRobot
Catalog: po/*/gvrng.po
Languages: de

source: "%s" has already been defined
de: "%s" wurde bereits definiert

source: "%s" is not a valid name
de: "%s" ist kein gültiger Name

source: "%s" is not a valid test
de: "%s" ist kein gültiger Test

source: "%s" not defined
de: "%s" ist nicht definiert

source: '%s' statement is incomplete
de: '%s' Anweisung ist unvollständig

source: <b>Alter the arguments for the 'robot' statement.</b>
de: <b> Verändere die Argumente der Roboter-Anweisung.</b>

source: <b>Code Editor</b>
de: <b> Programmeditor</b>

source: <b>Guido's World</b>
de: <b> Guidos Welt </b>

source: <b>World Editor</b>
de: <b> Landschaftseditor </b>

source: Abort
de: Abbruch

source: About GvR
de: Über GvR

source: BEEPERS
de: KORN

source: Bad x value for positioning robot: %s
de: Unzulaessiger X-Wert für den Hamster: %s

source: Bad y value for positioning robot: %s
de: Unzulaessiger Y-Wert für den Hamster: %s

source: Can't find the lessons. Make sure you have installed the GvR-Lessons package. Check the GvR website for the lessons package. http://gvr.sf.net
de: Ich kann die Übungen nicht finden. Prüfe, ob die Hamsterübungen installiert wurden! Schau auf der GvR-Webseite nach den Übungen! http://www.bvr.sf.net

source: Catalan Dutch English French Norwegian Romenian Spanish Italian
de: Katalanisch Holländisch Englisch Französisch Norwegisch Rumänisch Spanisch Italienisch

source: Change the language used (After you restart GvR)
de: Ändere die Sprache (Wird erst nach Neustart des Programms wirksam)

source: Choose a file
de: Wähle eine Landschaft

source: Direction robot is facing (N,E,S,W)
de: Himmelsrichtung, in die der Hamster schaut (N,O,S,W)

source: Do you really want to quit ?
de: Möchtest du wirklich aufhören?

source: E
de: O

source: Error in line %s: %s Check your world file for syntax errors
de: Fehler in Zeile %s: %s Prüfe deine Landschaft auf Syntax-Fehler

source: Execute
de: Führe aus

source: Expected '%s' statement to end in ':'
de: Die '%s' - Anweisung sollte beendet werden mit ':

source: Expected code to be indented here
de: Es wird eine Einrückung im Programmtext erwartet.

source: Expected positive integer Got: %s
de: Es wird eine positive ganze Zahl erwartet. Gefunden: %s

source: Failed to save the file.
de: Die Sicherung der Datei ist fehlgeschlagen.

source: Fast
de: Schnell

source: Go back one page
de: Gehe eine Seite zurück

source: Go one page forward
de: Gehe eine Seite vorwärts

source: Guido van Robot - Robot arguments
de: Guido van Robot - Hamster-Argumente

source: Guido van Robot Programming Summary
de: Guidi von Robot, Überblick über die Programmierung

source: Guido's World
de: Guidos Welt

source: GvR - Worldbuilder
de: GvR - Weltwerkstatt

source: GvR Worldbuilder
de: GvR Weltwerkstatt

source: Gvr Lessons
de: Hamsterübungen

source: Indentation error
de: Einrückungsfehler

source: Instant
de: Augenblicklich

source: Instant Fast Medium Slow
de: Augenblicklich Schnell Mittel Langsam

source: Introduction
de: Einführung

source: Language reference
de: Hamster Sprachbeschreibung

source: Lessons
de: Hamsterübungen

source: Line %i: %s
de: Zeile %i: %s

source: Medium
de: Mittel

source: No beepers to pick up.
de: Hier liegen keine Körner

source: No beepers to put down.
de: Ich habe keine Körner zum Ablegen

source: No content to save
de: Es gibt nichts zu sichern

source: Number of beepers:
de: Anzahl der Körner:

source: Open worldbuilder
de: Öffne die Weltwerkstatt

source: Please give the number of beepers to place on %d,%d
de: Gib bitte die Anzahl der Körner an die auf der Scholle abgelegt werden sollen: %d,%d

source: Please load a world and program before executing.
de: Bitte lade eine Landschaft und ein Programm, bevor du startest!

source: Programs
de: Programme

source: Quit ?
de: Beenden?

source: ROBOT
de: HAMSTER

source: Ran into a wall
de: Volle Kanne gegen die Wand gelaufen

source: Reload
de: Neu laden

source: Robot Speed
de: Hamstergeschwindigkeit

source: Robot turned off
de: Der Hamster ruht

source: Robots position is %s %s %s and carrying %s beepers
de: Guidos Position ist %s %s %s und er hat %s Körner in den Backen

source: Robots position on the x-axes:
de: GuidosPposition auf der X-Achse:

source: Robots position on the y-axes:
de: Guidos Position auf der Y-Achse:

source: Running Worldbuilder
de: Öffne Weltwerkstatt

source: SIZE
de: GRÖSSE

source: Selected path is not a program file
de: Der ausgewählte Pfad beschreibt keine Programmdatei

source: Selected path is not a world file
de: Der ausgewählte Pfad beschreibt keine Landschaftsdatei

source: Set Robot Speed
de: Setze die Hamstergeschwindiglkeit

source: Set language
de: Wähle eine Sprache

source: Set speed...
de: Setze die Geschwindigkeit ...

source: Slow
de: Langsam

source: Step
de: Schritt

source: The editor's content is changed. Do you want to save it?
de: Der Dateiinhalt wurde verändert. Soll die Datei gesichert werden?

source: WALL
de: WAND

source: Worlds
de: Landschaften

source: Written the new configuration to disk You have to restart GvRng to see the effect
de: Ich habe die neue Konfiguration gespeichert. GvR muss neu gestartet werden.

source: You don't have a program file loaded.
de: Es wurde keine Programmdatei geöffnet.

source: You don't have a world file loaded.
de: Es wurde keine Landschaft geöffnet

source: Your program must have commands.
de: Das Programm enthält keine Befehle

source: _About
de: _Über

source: _File
de: _Datei

source: _Help
de: _Hilfe

source: _Setup
de: _Konfiguration

source: any_beepers_in_beeper_bag
de: korn_in_backentasche

source: beepers
de: Körner

source: facing_east
de: blickrichtung_ost

source: facing_north
de: blickrichtung_nord

source: facing_south
de: blickrichtung_sued

source: facing_west
de: blickrichtung_west

source: front_is_blocked
de: vorn_nicht_frei

source: front_is_clear
de: vorn_frei

source: left_is_blocked
de: links_nicht_frei

source: left_is_clear
de: links_frei

source: move
de: vor

source: next_to_a_beeper
de: korn_da

source: no_beepers_in_beeper_bag
de: kein_korn_in_backentasche

source: not_facing_east
de: blickrichtung_nicht_ost

source: not_facing_north
de: blickrichtung_nicht_nord

source: not_facing_south
de: blickrichtung_nicht_sued

source: not_facing_west
de: blickrichtung_nicht_west

source: not_next_to_a_beeper
de: kein_korn_da

source: pickbeeper
de: nimm

source: putbeeper
de: gib

source: right_is_blocked
de: rechts_nicht_frei

source: right_is_clear
de: rechts_frei

source: robot
de: Hamster

source: turnleft
de: linksum

source: turnoff
de: ruhe

source: wall
de: Wand
